{
  "class-token": {
    "name": "channel-divinity",
    "level": 2,
    "available": 1
  },
  "sub-class": "",
  "prepared-spells": [""],
  "other-features": [
    {
      "name": "Harness Divine Power",
      "level": 2,
      "details": "You can expend a use of your Channel Divinity to fuel your spells. As a bonus action, you touch your holy symbol, utter a prayer, and regain one expended spell slot, the level of which can be no higher than half your proficiency bonus (rounded up). The number of times you can use this feature is based on the level you've reached in this class: 2nd level, once; 6th level, twice; and 18th level, thrice. You regain all expended uses when you finish a long rest.\n"
    },
    {
      "name": "Channel Divinity",
      "level": 2,
      "details": "You gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n\n- lvl 1: 1\n- lvl 6: 2\n- lvl 10: 3\n\n*Turn Undead*\nAs an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.\n"
    },
    {
      "name": "Destroy Undead",
      "level": 5,
      "details": "When an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Cleric table above.\n"
    },
    {
      "name": "blessed strikes",
      "level": 8,
      "details": "you are blessed with divine might in battle. when a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. once you deal this damage, you can't use this feature again until the start of your next turn.\n"
    },
    {
      "name": "blessed strikes",
      "level": 10,
      "details": "Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. At 20th level, your call for intervention succeeds automatically, no roll required.\n"
    }
  ]
}
