{
  "ki-points": {
    "spell-save-dc": 0,
    "maximum": 1,
    "available": 1
  },
  "mosaic-tradition": "",
  "other-features": [
    {
      "name": "Martial Arts",
      "level": 1,
      "details": "Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property. You gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield:\n- You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\n- You can roll your martial arts die value in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\n  - lvl 1: 1d4\n  - lvl 5: 1d6\n  - lvl 11: 1d8\n  - lvl 17: 1d10\n- When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.\n"
    },
    {
      "name": "Ki",
      "level": 2,
      "details": "Your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points, which is equal to your level. When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points. Some of your ki features require your target to make a saving throw to resist the feature's effects."
    },
    {
      "name": "Deticated Weapon",
      "level": 2,
      "details": "You train yourself to use a variety of weapons as monk weapons, not just simple melee weapons and shortswords. Whenever you finish a short or long rest, you can touch one weapon, focus your ki on it, and then count that weapon as a monk weapon until you use this feature again. The chosen weapon must meet these criteria:\n- The weapon must be a simple or martial weapon.\n- You must be proficient with it.\n- It must lack the heavy and special properties."
    },
    {
      "name": "Deflect Missles",
      "level": 3,
      "details": "You can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with a range of 20/60 using the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack.\n"
    },
    {
      "name": "Ki-Fueled Attack",
      "level": 3,
      "details": "If you spend 1 ki point or more as part of your action on your turn, you can make one attack with an unarmed strike or a monk weapon as a bonus action before the end of the turn.\n"
    },
    {
      "name": "Slow Fall",
      "level": 4,
      "details": "You can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.\n"
    },
    {
      "name": "Extra Attack",
      "level": 5,
      "details": "You can attack twice, instead of once, whenever you take the Attack action on your turn.\n"
    },
    {
      "name": "Stunning Strike",
      "level": 5,
      "details": "You can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.\n"
    },
    {
      "name": "Focused Aim",
      "level": 5,
      "details": "When you miss with an attack roll, you can spend 1 to 3 ki points to increase your attack roll by 2 for each of these ki points you spend, potentially turning the miss into a hit.\n"
    },
    {
      "name": "Ki-Empowered Strikes",
      "level": 6,
      "details": "Your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n"
    },
    {
      "name": "Evasion",
      "level": 7,
      "details": "Your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.\n"
    },
    {
      "name": "Stillness of Mind",
      "level": 7,
      "details": "You can use your action to end one effect on yourself that is causing you to be charmed or frightened.\n"
    },
    {
      "name": "Purity of Body",
      "level": 10,
      "details": "Your mastery of the ki flowing through you makes you immune to disease and poison.\n"
    },
    {
      "name": "Tongue of the Sun and Moon",
      "level": 13,
      "details": "You learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.\n"
    },
    {
      "name": "Diamond Soul",
      "level": 14,
      "details": "All saving throw proficiencies have been set to true. Also, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.\n"
    },
    {
      "name": "Timeless Body",
      "level": 15,
      "details": "Your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water.\n"
    },
    {
      "name": "Empty Body",
      "level": 18,
      "details": "You can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. You can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can't take any other creatures with you.\n"
    },
    {
      "name": "Perfect Self",
      "level": 20,
      "details": "When you roll for initiative and have no ki points remaining, you regain 4 ki points.\n"
    }
  ]
}
